---
kind: property
id: P:Autodesk.Revit.DB.DividedSurface.VPatternIndent
source: html/2e1c2b7b-2a2f-c7f2-ad66-15d72739e8ac.htm
---
# Autodesk.Revit.DB.DividedSurface.VPatternIndent Property

The offset applied to the pattern by an
integral number of grid nodes in the V-direction.

## Syntax (C#)
```csharp
public int VPatternIndent { get; set; }
```